Repository: PisiLinuxNew/pisi
Catalog: po/*.po
Languages: ru

source: Build and install PiSi source packages from repository Usage: emerge <sourcename> ... You should give the name of a source package to be downloaded from a repository containing sources. You can also give the name of a component.
ru: Создать и установить пакет исходных файлов PiSi из репозитория Использование: emerge <имя исходноников>... Вам следует указать имя пакета с исходными файлами, который будет скачан с репозитория, содержащего такие файоы. Вы также можете задать имя компонента.

source: emerge options
ru: emerge опции

source: Emerge available packages under given component
ru: Собрать выбранные пакеты в занный компонент

source: Ignore file conflicts
ru: Игнорировать конфликтующие файлы

source: Ignore package conflicts
ru: Игнорировать конфликты пакетов

source: Output directory: %s
ru: Конечная дериктория: %s

source: Outputting binary packages in the package cache.
ru: Бинарные пакеты, как результат, в кэше пакетов.

source: Build and install PiSi source packages from repository Usage: emergeup ... You should give the name of a source package to be downloaded from a repository containing sources. You can also give the name of a component.
ru: Создать и установить пакет согласно исходным файлам PiSi из репозитория Использование: emerge <имя исходников>... Вам следует указать имя пакета с исходными файлами, который будет скачан с репозитория, содержащего такие файлы. Вы также можете задать имя компонента.

source: emergeup options
ru: Опции emergeup

source: Enable repository Usage: enable-repo [<repo1> <repo2> ... <repon>] <repoi>: repository name Disabled repositories are not taken into account in operations
ru: Включить репозиторий Использование: enable-repo [<repo1> <repo2> ... <repon>] <repoi>: имя репозитория Отключенные репозитории не используются при операциях над пакетами

source: Fetch a package Usage: fetch [<package1> <package2> ... <packagen>] <packagei>: package name Downloads the given pisi packages to working directory
ru: Скачать пакет Использование: fetch [<пакет1> <пакет2> ... <пакетn>] <пакетi>: имя пакета Скачивает заданные пакеты pisi в рабочую директорию

source: fetch options
ru: fetch опции

source: Output directory for the fetched packages
ru: Директория для скачанных пакетов

source: Also fetch runtime dependencies
ru: Также скачать зависимости

source: Graph package relations Usage: graph [<package1> <package2> ...] Write a graph of package relations, tracking dependency and conflicts relations starting from given packages. By default shows the package relations among repository packages, and writes the package in graphviz format to 'pgraph.dot'.
ru: График связей между пакетами Использование: graph [<пакет1> <пакет2> ...] Создать график связей между пакетами, отслеживающий зависимости и конфликты, начиная с заданных пакетов. По умолчанию показывает связи между пакетами в репозитории и записывает результат в формате graphviz в файл 'pgraph.dot'.

source: graph options
ru: graph опции

source: Specify a particular repository
ru: Установить особый репозиторий

source: Graph of installed packages
ru: График установленных пакетов

source: Do not show installed packages
ru: Не показывать установленные пакеты

source: Draw reverse dependency graph
ru: Нарисовать график обратных зависимостей

source: Dot output file
ru: Окончательное размещение файла

source: Plotting packages in repository %s
ru: Размещение пакетов в репозитории %s

source: Plotting a graph of relations among all repository packages
ru: Создание графика связей между всеми пакетами в репозитории

source: Plotting a graph of relations among all installed packages
ru: Создание графика связей между всеми установленными пакетами

source: Prints help for given commands Usage: help [ <command1> <command2> ... <commandn> ] If run without parameters, it prints the general help.
ru: Выводит помощь для заданных команд Использование: help [ <команда1> <команда2> ... <командаn> ] Если запущено без параметров, выводит общую помощь.

source: %prog [options] <command> [arguments] where <command> is one of:
ru: %prog [options] <command> [arguments] где <command> это одна из:

source: Use "%prog help <command>" for help on a specific command.
ru: Используйте "%prog help <команда>" для проверки особой команды.

source: upgrade
ru: обновить

source: remove
ru: удалить

source: install
ru: установить

source: takeback
ru: возврат

source: repository update
ru: обновление репозитория

source: History of pisi operations Usage: history Lists previous operations.
ru: История операций pisi Использование: history Список предыдущих операций.

source: history options
ru: history опции

source: Output only the last n operations
ru: Вывод только последней операции

source: Take snapshot of the current system
ru: Создать образ текущей системы

source: Takeback to the state after the given operation finished
ru: Вернуться к состоянию, после того, как операция будет выполнена

source: Operation #%d: %s
ru: Операция #%d: %s

source: Date: %s %s
ru: Дата: %s %s

source: * There are %d packages in this snapshot.
ru: * %d пакетов в этом образе.

source: Index PiSi files in a given directory Usage: index <directory> ... This command searches for all PiSi files in a directory, collects PiSi tags from them and accumulates the information in an output XML file, named by default 'pisi-index.xml'. In particular, it indexes both source and binary packages. If you give multiple directories, the command still works, but puts everything in a single index file.
ru: Индексировать файлы PiSi в заданной дитектории Использование: index <directory> ... Эта команда ищет все файлы PiSi в директории, собирает тэги из них и суммирует всю информацию в одном выходном файле XML, который по умолчанию называется 'pisi-index.xml'. В частности он индексирует и файлы исходников и бинарные пакеты. Если вы зададите несколько директорий, команда сработает, но все будет собрано в одном индексном файле.

source: index options
ru: index опции

source: Store absolute links for indexed files.
ru: Хранить жесткие ссылки на индексированные файлы.

source: Index output file
ru: Файл для индексирования

source: Comma-separated compression types for index file
ru: Разделенные запятыми типы сжатия для индексного файла

source: Do not index PiSi spec files.
ru: Не индексировать спек-файлы.

source: Do not sign index.
ru: Не отмечать индекс.

source: Display package information Usage: info <package1> <package2> ... <packagen> <packagei> is either a package name or a .pisi file,
ru: Просмотр информации о пакете Использование: info <package1> <package2> ... <packagen> <packagei> is either a package name or a .pisi file,

source: info options
ru: info опции

source: Show a list of package files.
ru: Показать список пакетов.

source: Info about the given component
ru: Информировать о заданном компоненте

source: Show only paths.
ru: Показать только пути.

source: Do not show details
ru: Не показывать подробности

source: Output in xml format
ru: Вывод в формате xml

source: Reverse Dependencies:
ru: Необходим для:

source: Reverse Build Dependencies:
ru: Обратные зависимости для сборки:

source: Package file: %s
ru: Файл пакета: %s

source: Installed package:
ru: Установка пакета:

source: %s package is not installed
ru: %s пакет не установлен

source: Package found in %s repository:
ru: Пакет найден в репозитории %s:

source: %s package is not found in binary repositories
ru: %s пакет не найден в репозитории с бинарными пакетами

source: %s package is not found in source repositories
ru: %s пакет не найден в репозитории с исходными кодами

source: Install PiSi packages Usage: install <package1> <package2> ... <packagen> You may use filenames, URI's or package names for packages. If you have specified a package name, it should exist in a specified repository. You can also specify components instead of package names, which will be expanded to package names.
ru: Установить пакеты PiSi Использование: install <пакет1> <пакет2> ... <пакетn> Вы можете использовать имена файлов, ссылки или имена пакетов для установки. Если у вас определено имя пакета, он должен существовать в заданном репозитории. Вы можете также задать компоненты вместо названий пакетов, тогда они будут выбраны как наборы пакетов.

source: install options
ru: install оции

source: Reinstall already installed packages
ru: Переустановить уже установленные пакеты

source: Skip distribution release and architecture check
ru: Пропустить выпуск распределения и проверку архитектуры

source: Install component's and recursive components' packages
ru: Установить пакеты компонентов и рекурскивные пакеты компонентов

source: Name of the component's repository
ru: Название репозитория компонентов

source: Fetch upgrades but do not install.
ru: Выполнить обновление, но не устанавливать.

source: When installing packages, ignore packages and components whose basenames match pattern.
ru: В процессе установки пакетов игнорировать пакеты и компоненты, чьи названия соответствуют шаблону.

source: When installing packages, ignore packages and components whose basenames match any pattern contained in file.
ru: В процессе установки пакетов игнорировать пакеты и компоненты, чьи названия соответствуют шаблону, находящемуся в файле.

source: Store previous libraries info when package is updating to newer version.
ru: Сохранить информацию о библиотеках при обновлении пакета до новой версии.

source: There is no component named %s
ru: Нет компонента с названием %s

source: List available packages in the repositories Usage: list-available [ <repo1> <repo2> ... repon ] Gives a brief list of PiSi packages published in the specified repositories. If no repository is specified, we list packages in all repositories.
ru: Показать доступные пакеты в репозиториях Использование: list-available [<repo1> <repo2> ... <repon>] Показывает список пакетов PiSi, содержащихся в заданных репозиториях. Если не задан ни один репозиторий, будут показаны пакеты из всех репозиториев.

source: list-available options
ru: list-available опции

source: Show in long format
ru: Показать в расширенном формате

source: List available packages under given component
ru: Показать доступные пакеты в данном компоненте

source: Show uninstalled packages only
ru: Показать только не установленные пакеты

source: Installed packages are shown in this color
ru: Установленные пакеты показываются данным цветом

source: Repository : %s
ru: Репозиторий : %s

source: List available components Usage: list-components Gives a brief list of PiSi components published in the repositories.
ru: Показать доступные компоненты Использование: list-components Дает краткий перечень PiSi компонентов, опубликованных в репозиториях.

source: list-components options
ru: опции list-component

source: Name of the source or package repository
ru: Имя исходного или пакетного репозитория

source: Print the list of all installed packages Usage: list-installed
ru: Печать списка всех установленных пакетов Использование: list-installed

source: list-installed options
ru: опции list-installed

source: Only list the installed packages built by the given host
ru: Показать только список установленных пакетов, собранных указанным хостом

source: List installed packages under given component
ru: Список доступных пакетов по данному компоненту

source: Show detailed install info
ru: Показать детальную информацию об установке

source: Package Name |St| Version| Rel.| Distro| Date
ru: Имя пакета |Ст| Версия| Рел.| Дистр.| Дата

source: List newest packages in the repositories Usage: list-newest [ <repo1> <repo2> ... repon ] Gives a list of PiSi newly published packages in the specified repositories. If no repository is specified, we list the new packages from all repositories.
ru: Список новых пакетов в репозиториях Использование: list-newest [ <repo1> <repo2> ... repon ] Выдает список новых PiSi-пакетов, опубликованных в заданных репозиториях. Если репозиторий не задан, мы получим список новых пакетов из всех репозиториев.

source: list-newest options
ru: опции list-newes

source: List new packages added to repository after this given date formatted as yyyy-mm-dd
ru: Показать новые пакеты, добавленные в репозиторий после указанной даты в формате yyyy-mm-dd

source: List new packages added to repository after last nth previous repository update
ru: Показать список новых пакетов, добавленных в репозиторий после последнего обновления

source: Packages added to %s since %s:
ru: Пакеты добавлены в %s с %s:

source: Packages added to %s:
ru: Пакеты добавлены в %s:

source: List orphaned packages Usage: list-orphaned Lists packages installed as dependency, but no longer needed by any other installed package.
ru: Список заброшенных пакетов Команда: list-orphaned(lo) Список отныне не требуемых пакетов, ранее установленных как зависимости.

source: list-orphaned options
ru: опции list-orphaned

source: Show all packages without reverse dependencies
ru: Показать все пакеты, явно не указанные как необходимые другим пакетам

source: Ignore packages and components whose basenames match pattern.
ru: Игнорировать пакеты и компоненты, чьи базовые названия соответсвуют шаблону.

source: Orphaned packages:
ru: Заброшенные пакеты:

source: No orphaned packages
ru: Нет заброшенных пакетов

source: List pending packages Lists packages waiting to be configured.
ru: Показать ожидающие пакеты Показать пакеты, ожидающие настройки.

source: There are no packages waiting to be configured
ru: Нет пакетов, ожидающих конфигурирования

source: List repositories Usage: list-repo Lists currently tracked repositories.
ru: Список репозиториев Использование: list-repo Показать текущие используемые репозитории.

source: active
ru: активен

source: inactive
ru: не активен

source: List available sources Usage: list-sources Gives a brief list of sources published in the repositories.
ru: Показать список доступных источников Использование: list-sources Предоставляет краткий список источников, опубликованных в репозиториях.

source: list-sources options
ru: опции list-sources

source: List packages to be upgraded Usage: list-upgrades Lists the packages that will be upgraded.
ru: Показать список пакетов для обновления Использование: list-upgrades Показывает пакеты, которые будут обновлены.

source: list-upgrades options
ru: опции list-upgrades

source: List upgradable packages under given component
ru: Показать обновляемые пакеты по указанному компоненту

source: No packages to upgrade.
ru: Нет пакетов для обновления.

source: Options must precede non-option arguments
ru: Функции должны предшествовать аргументам без опций

source: No command given
ru: Не задана команда

source: Command line parsing error
ru: Ошибка разбора командной строки

source: Rebuild Databases Usage: rebuilddb [ <package1> <package2> ... <packagen> ] Rebuilds the PiSi databases If package specs are given, they should be the names of package dirs under /var/lib/pisi
ru: Обновить базу данных Использование: rebuilddb [ <пакет1> <пакет2> ... <пакетn> ] Обновит базу данных PiSi Если даны спецификации пакета,они должны быть именами пакетов каталоги под /var/lib/pisi

source: rebuild-db options
ru: опции rebuild-db

source: Rebuild files database
ru: Обновление базы данных файлов

source: Rebuild PiSi databases?
ru: Обновить базу данных PiSi?

source: Remove PiSi packages Usage: remove <package1> <package2> ... <packagen> Remove package(s) from your system. Just give the package names to remove. You can also specify components instead of package names, which will be expanded to package names.
ru: Удалить PiSi пакеты Использование: remove <пакет1> <пакет2> ... <пакетn> Удалит пакет(ы) из Вашей системы. Просто укажите имена пакетов для удаления. Вы также можете указать компоненты вместо имен пакетов, которые будут раскрыты в имена пакетов.

source: remove options
ru: remove опции

source: Removes everything including changed config files of the package
ru: Удалить все, включая измененные конфигурационные файлы пакета

source: Remove component's and recursive components' packages
ru: Удалить компоненты и рекурсивные пакеты компонентов

source: Remove orphaned packages Usage: remove-orphaned Remove all orphaned packages from the system.
ru: Удалить заброшенные пакеты Команда: remove-orphaned(ro) Удалить все заброшенные пакеты из системы.

source: remove-orphaned options
ru: опции remove-orphaned

source: When removing orphaned, ignore packages and components whose basenames match pattern.
ru: Игнорировать пакеты и компоненты, чьи базовые названия соответсвуют шаблону.

source: Remove repositories Usage: remove-repo <repo1> <repo2> ... <repon> Remove all repository information from the system.
ru: Удалить репозитории Использование: remove-repo <репозиторий1> <репозиторий2> ... <репозиторийn> Удалит всю информацию о репозитории из системы.

source: Search packages Usage: search <term1> <term2> ... <termn> Finds a package containing specified search terms in summary, description, and package name fields. Default search is done in package database. Use options to search in install database or source database.
ru: Искать пакеты Использование: search <термин1> <термин2> ... <терминn> Ищет пакет, содержащий указанные поисковые термины таким образом, поля описание и имя пакета. По умолчанию поиск осуществляется в базе данных пакетов. Используемые опции для поиска в базе данных установленных или исходных базы данных.

source: search options
ru: search опции

source: Summary and description language
ru: Резюме и описание языка

source: Search in installdb
ru: Искать в installdb

source: Search in sourcedb
ru: Искать в sourcedb

source: Case sensitive search
ru: Регистрозависимый поиск

source: Search in the package name
ru: Поиска в именах пакетов

source: Search in the package summary
ru: Искать в резюме пакета

source: Search in the package description
ru: Поиск в описании пакетов

source: Search for a file Usage: search-file <path1> <path2> ... <pathn> Finds the installed package which contains the specified file.
ru: Искать файл Использование: search-file <путь1> <путь2> ... <путьn> Ищет установленный пакет, который содержит указанный файл.

source: search-file options
ru: search-file опции

source: Show only package name
ru: Показать только имя пакета

source: Package %s has file /%s
ru: Пакет %s содержит файл /%s

source: Path '%s' does not belong to an installed package
ru: Путь '%s' не принадлежит установленному пакету

source: Searching for %s
ru: Поиск для %s

source: Update repository databases Usage: update-repo [<repo1> <repo2> ... <repon>] <repoi>: repository name Synchronizes the PiSi databases with the current repository. If no repository is given, all repositories are updated.
ru: Обновить базы данных репозиториев Использование: update-repo [<repo1> <repo2> ... <repon>] <repoi>: имя репозитория Синхронизирует базы данных PiSi с текущим репозиторием. Если не задано репозиториев, все репозитории обновляются.

source: update-repo options
ru: update-repo опции

source: Update database in any case
ru: Обновление базы данных в любом случае

source: Upgrade PiSi packages Usage: Upgrade [<package1> <package2> ... <packagen>] <packagei>: package name Upgrades the entire system if no package names are given You may use only package names to specify packages because the package upgrade operation is defined only with respect to repositories. If you have specified a package name, it should exist in the package repositories. If you just want to reinstall a package from a PiSi file, use the install command. You can also specify components instead of package names, which will be expanded to package names.
ru: Обновить пакеты PiSi Использоваие: Upgrade [<package1> <package2> ... <packagen>] <packagei>: имя пакета Обновляет всю систему, если не заданы имена пакетов. Вы можете использовать только имена пакетов, потому что операция обновления пакета определена только в соответствии с репозиториями. Если вы задали имя пакета, он должен существовать в репозиториях. Если вы просто хотите перестановить пакет из PiSi-файла, используйте команду установки. Вы также можете задать компоненты вместо имен пакетов, которые потом будут преобразованы в имена пакетов.

source: upgrade options
ru: upgrade опции

source: Security related package upgrades only
ru: Обновления только по вопросам безопасности

source: Do not update repositories
ru: Не обновлять репозитории

source: Upgrade component's and recursive components' packages
ru: Обновление компонентов и рекурсивных компонентов пакетов

source: Name of the to be upgraded packages' repository
ru: Название для обновления пакетов репозитория

source: When upgrading system, ignore packages and components whose basenames match pattern.
ru: При обновлении системы, игнорировать пакеты и компоненты, чьи базовые названия соответсвуют шаблону.

source: When upgrading system, ignore packages and components whose basenames match any pattern contained in file.
ru: При обновлении системы игнорировать пакеты и компоненты, чьи базовые названия соответствуют любому шаблону, содержащемуся в файле.

source: compare sha1sum repo and installed packages
ru: Сравнить контрольные суммы репозитория и установленных пакетов

source: Updating repositories
ru: Обновление репозиториев

source: Will not update repositories
ru: Не обновлять репозитории

source: comar-api package is not fully installed
ru: Пакет comar-api установлен не полностью

source: Cannot connect to COMAR: %s
ru: Невозможно соединиться с COMAR: %s

source: Configuring %s package
ru: Настройка %s пакета

source: COMAR package updated. From now on, using new COMAR daemon.
ru: Пакет COMAR обнавлен. С текущего момента используется новый демон COMAR.

source: Registering %s comar script
ru: Регистрация comar-скрипта %s

source: Script error: %s
ru: Ошибка скрипта: %s

source: Calling post install handlers
ru: Вызов послеустановочных обработчиков

source: Running package's post install script
ru: Запуск послеустановочного скрипта

source: Running pre removal operations for %s
ru: Запуск операций перед удалением %s

source: Running package's pre remove script
ru: Запустить сценарий, используемый перед удалением, пакета

source: Calling pre remove handlers
ru: Вызов предустановочных обработчиков

source: Running post removal operations for %s
ru: Запуск операций после удаления для %s

source: Running package's postremove script
ru: Запустить сценарий, используемый после удаления, пакета

source: Calling post remove handlers
ru: Вызов послеудаляционных обработчиков

source: Unregistering comar scripts
ru: Отмена регистрации сценариев comar

source: Destination directory %s does not exist. Creating it.
ru: Конечный каталог %s не существует. Каталог создаётся.

source: No section by name '%s'
ru: Нет секции с именем '%s'

source: version >=
ru: версия >=

source: version <=
ru: версия <=

source: version
ru: версия

source: release >=
ru: релиз >=

source: release <=
ru: релиз <=

source: release
ru: релиз

source: Can't rebind constant: %s
ru: Не удаётся привязать константе: %s

source: Can't unbind constant: %s
ru: Не удаётся отвязать от константы: %s

source: Component %s not found
ru: Компонент %s не найден

source: Creating files database...
ru: Обновление базы данных...

source: Adding '%s' to db...
ru: Добавление '%s' в базу данных...

source: OK.
ru: ОК.

source: done.
ru: завершено.

source: Cleaning files database folder...
ru: Обновление каталога базы данных...

source: Group %s not found
ru: Группа %s не найдена

source: installed
ru: установлен

source: installed-pending
ru: установлен-ожидаемый

source: State: %s Version: %s, Release: %s
ru: Состояние: %s Версия: %s, Релиз: %s

source: Distribution: %s, Install Time: %s
ru: Дистрибутив: %s, Время установки: %s
