Repository: PisiLinuxNew/pisi
Catalog: po/*.po
Languages: ru

source: Installation info for package '%s' is broken. Reinstall it to fix this problem.
ru: Информация для установки пакета '%s' повреждена. Переустановите для исправления этой ошибки.

source: Package %s is not installed
ru: Пакет %s не установлен

source: %s not found in any repository.
ru: %s не обнаружен ни в одном репозитории.

source: Repo item %s not found
ru: Элемент %s репозитория не обнаружен

source: Repository %s does not exist.
ru: Репозиторий %s не существует.

source: Package %s not found.
ru: Пакет %s не найден.

source: %s repository needs to be updated
ru: репозиторий %s нуждается в обновлении

source: Error parsing repository index information. Index file does not exist or is malformed.
ru: Ошибка разбора информации индекса репозитория. Файл индекса не существует или неправильный.

source: Repository '%s' is not compatible with your distribution. Repository is disabled.
ru: Репозиторий '%s' не совместим с Вашим дистрибутивом. Репозиторий отключен.

source: Urlgrabber needs to be installed to run this command
ru: Urlgrabber должен быть установлен для запуска этой команды

source: Filename error
ru: Ошибка имени файла

source: Access denied to write to destination directory: "%s"
ru: Нет прав для записи в целевую директорию: "%s"

source: Access denied to destination file: "%s"
ru: Доступ запрещен к целевуму файлу: "%s"

source: Could not fetch destination file "%s": %s
ru: Не удалось получить конечный файл "%s": %s

source: A problem occurred. Please check the archive address and/or permissions again.
ru: Возникла проблема. Пожалуйста, проверьте архивный адрес и/или разрешения вновь.

source: Proxy configuration has been found for '%s' protocol
ru: Обнаружена конфигурация прокси-сервера для протокола '%s'

source: Bandwidth usage is limited to %s KB/s
ru: Использование полосы пропускания ограничено %s Кб/с

source: Remote file can not be reached. Previously downloaded part of the file will be removed.
ru: Нет доступа к удаленному файлу. Скачанная предварительно часть файла будет удалена.

source: Server doesn't support partial downloads. Previously downloaded part of the file will be over-written.
ru: Сервер не поддерживает скачивание по частям. Ранее скачанная часть файла будет перезаписана.

source: URL %s already downloaded as %s
ru: URL %s уже загружен как %s

source: No signature found for %s
ru: Подпись не найдена для %s

source: invalid for %s
ru: неверно для %s

source: uri must have type either URI or string
ru: uri должен иметь тип URI или строковый

source: Fetching %s
ru: Извлечение %s

source: Copying %s to transfer dir
ru: Копирование %s в каталог для передачи

source: File '%s' not found.
ru: Файл '%s' не найден.

source: File integrity of %s compromised.
ru: Целостность файла %s скомпрометирована.

source: File mode must be either File.read or File.write
ru: Доступ к файлу должен быть для чтения или для записи

source: Remote write not implemented
ru: Удаленная запись не реализована

source: ERROR: gpg --detach-sig %s failed
ru: ОШИБКА: gpg --detach-sig %s не удалось

source: Encountered cycle %s
ru: Обнаружен цикл %s

source: %s repository is updated.
ru: %s репозиторий обновлен.

source: %s is upgraded from %s to %s with delta.
ru: %s обновлен с %s до %s при помощи применения разности пакетов (т.н. delta)

source: %s is upgraded from %s to %s.
ru: %s обновлен с %s до %s.

source: %s %s is removed.
ru: %s %s удален.

source: %s %s is installed.
ru: %s %s установлен.

source: %s %s is reinstalled.
ru: %s %s переустановлен.

source: %s is downgraded from %s to %s.
ru: %s обновлен с %s до более ранней версии %s.

source: Unknown package operation
ru: Неизвестная операция с пакетом

source: Sorting: %s
ru: Сортировка: %s

source: Adding packages from directory %s...
ru: Добавление пакетов из каталога %s...

source: Adding packages from directory %s... done.
ru: Добавление пакетов из каталога %s... завершено.

source: Adding package to index: %s
ru: Добавление пакета в индекс: %s

source: Package %s: metadata corrupt, skipping...
ru: Пакет %s: метаданные повреждены, пропуск...

source: Adding groups.xml to index
ru: Добавление groups.xml к индексу

source: Adding components.xml to index
ru: Добавление components.xml к индексу

source: Adding distribution.xml to index
ru: Добавление distribution.xml к индексу

source: Adding %s to source index
ru: Добавление %s в индекс исходника

source: Distribution: %s, Dist. Release: %s
ru: Дистрибутив: %s, Релиз дистр.: %s

source: Architecture: %s, Installed Size: %s
ru: Архитектура: %s, Размер установки: %s

source: , Package Size: %s
ru: , Размер пакета: %s

source: Mirrors file %s does not exist. Could not resolve mirrors://
ru: Файл зеркал %s не существует. Невозможно определить mirrors://

source: Path %s belongs in multiple packages
ru: Путь %s содержится в нескольких пакетах

source: Removing special file skipped for: %s
ru: Удаление специального пропущенного файла, для %s

source: Source URI: %s
ru: Адрес исходного кода: %s

source: Source %s not found in any active repository.
ru: Исходный код %s не обнаружен ни в одном активном репозитории.

source: pspec.xml avoids this package from building for '%s'
ru: pspec.xml избегает этот пакет для сборки для '%s'

source: Building source package: %s
ru: Сборка пакета с исходным кодом: %s

source: ccache detected...
ru: ccache обнаружен...

source: IceCream detected. Make sure your daemon is up and running...
ru: Обнаружен IceCream. Убедитесь, что ваш демон запущен.

source: Rebuilding for %s
ru: Пересборка %s

source: Cannot find component.xml in remote directory, Source is now part of unknown component
ru: Не найден файл component.xml в удаленном каталоге. Пакет сейчас является частью неизвестного компонента

source: Cannot find component.xml in upper directory, Source is now part of unknown component
ru: Не найден файл component.xml в верхнем каталоге. Пакет сейчас является частью неизвестного компонента

source: Unpacking archive(s)...
ru: Распаковка архива(ов)...

source: unpacked (%s)
ru: распакован (%s)

source: Setting up source...
ru: Настройка исходных кодов...

source: Building source...
ru: Сборка из исходных кодов...

source: Testing package...
ru: Тестирование пакета...

source: Installing...
ru: Установка...

source: Unable to read Actions Script (%s): %s
ru: Невозможно прочитать Actions Script (%s): %s

source: SyntaxError in Actions Script (%s): %s
ru: Ошибка синтаксиса в Actions Script (%s): %s

source: Unable to read COMAR script (%s): %s
ru: Невозможно прочитать COMAR script (%s): %s

source: SyntaxError in COMAR file (%s): %s
ru: Ошибка синтаксиса в COMAR script (%s): %s

source: Sandbox violation: %s (%s -> %s)
ru: Нарушение среды сборки: %s (%s -> %s)

source: ERROR: WorkDir (%s) does not exist
ru: ОШИБКА: Рабочая директория (%s) не существует

source: Sandbox enabled build...
ru: Построение песочницы включено...

source: Sandbox violation result:
ru: Результат нарушения песочницы:

source: Sandbox violations!
ru: Нарушения песочницы!

source: unable to call function from actions: %s
ru: Не удалось вызвать функцию из действий: %s

source: Source package '%s' defines a relative 'Path' element: %s
ru: Пакет исходников '%s' устанавливает относительный элемент 'Path' : %s

source: Source package '%s' defines multiple 'Path' tags for %s
ru: Пакет исходников '%s' устанавливает множественные теги 'Path' для %s

source: Safety switch: following extra packages in system.devel will be installed:
ru: Изменение безопасности: следующие пакеты из группы 'system.devel' будут установлены:

source: Safety switch: the component system.devel cannot be found
ru: Изменение безопасности: компонент system.devel не найден

source: Unsatisfied Build Dependencies:
ru: Неудовлетворенные зависимости сборки:

source: Cannot build package due to unsatisfied build dependencies
ru: Не могу собрать пакет из-за неудовлетворенных зависимостей для сборки

source: Build dependency %s cannot be satisfied
ru: Зависимость сборки %s не может быть удовлетворена

source: Do you want to install the unsatisfied build dependencies
ru: Вы хотите установить зависимости для сборки

source: Installing build dependencies.
ru: Установка зависимостей для сборки.

source: Ignoring build dependencies.
ru: Игнорирование зависимостей для сборки.

source: Patch file is missing: %s
ru: Файл патча не найден или отсутствует: %s

source: Patch file is empty: %s
ru: Файл патча отсутствует: %s

source: Applying patch: %s
ru: Применение патча: %s

source: /%s has suid bit set
ru: /%s поставлен бит suid

source: No user named '%s' found on the system
ru: Пользователь по имени '%s' не найден в системе

source: No group named '%s' found on the system
ru: Группа '%s' не найдена в системе

source: There are abandoned files under the install dir (%s):
ru: Есть заброшенные файлы в каталоге установки (%s):

source: Ignoring empty package %s
ru: Игнорирование пустого пакета %s

source: Building package: %s
ru: Сборка пакета: %s

source: Creating %s...
ru: Создание %s...

source: Cleaning build directory...
ru: Очистка директории сборки...

source: Keeping build directory
ru: Сохранение каталога сборки

source: Action script error caught.
ru: Обнаружена ошибка в Action Script.

source: *** %d error(s), %d warning(s)
ru: *** %d ошибка(ок), %d предупреждение(ий).

source: Last state was '%s'
ru: Последнее состояние было '%s'

source: The file '%s' belongs to a different package other than '%s'. Skipping it...
ru: Файл '%s принадлежит другому пакету, чем '%s'. Пропуск...

source: Package '%s' has the same release number with the new package. Skipping it...
ru: Пакет '%s' имеет один и тот же номер релиза, что и новый пакет. Пропускаем...

source: All files in the package '%s' are different from the files in the new package. Skipping it...
ru: Все файлы в пакете '%s' отличаются от файлов в новом пакете. Пропускаем ...

source: New package '%s' exists in the list of old packages. Skipping it...
ru: Новый пакет '%s' существует в списке старых пакетов. Пропускаем...

source: No packages to emerge.
ru: Нет пакетов для сборки.

source: The following list of packages will be installed from repository in the respective order to satisfy dependencies:
ru: Следующий список пакетов будет установлен из репозитория в соответствии с зависимостями:

source: The following list of packages will be built and installed in the respective order to satisfy dependencies:
ru: Следующий список пакетов будет собран и установлен в соответствии с зависимостями:

source: There are extra packages due to dependencies. Do you want to continue?
ru: Необходимо установить дополнительные пакеты. Вы хотите продолжить?

source: Cannot find source package: %s
ru: Не могу найти пакет исходного кода: %s

source: Selected packages [%s] are in conflict with each other.
ru: Выбранные пакеты [%s] конфликтуют с другими.

source: [%s conflicts with: %s]
ru: [%s конфликтует с: %s]

source: The following packages have conflicts: %s
ru: Следующие пакеты имеют конфликты: %s

source: Remove the following conflicting packages?
ru: Удалить следующие конфликтующие пакеты?

source: Conflicting packages should be removed to continue
ru: Конфликтующие пакеты должны быть удалены, чтобы продолжить

source: %s could not be found
ru: %s не обнаружен

source: %s [cached]
ru: %s [кэшировано]

source: Following packages will be installed:
ru: Следующие пакеты будут установлены:

source: Following packages will be removed:
ru: Следующие пакеты будут удалены:

source: Do you want to continue?
ru: Вы хотите продолжить?

source: Downloading %d / %d
ru: Загрузка %d / %d

source: Following packages could not be found in repositories and are not cached:
ru: Следующие пакеты не могут быть найдены в репозиториях и в кэше:

source: The following package(s) are already installed and are not going to be installed again:
ru: Следующий пакет (ы) уже установлены и не будет установлен еще раз:

source: No packages to install.
ru: Нет пакетов для установки.

source: Following packages will be installed:
ru: Следующие пакеты будут установлены:

source: Total size of package(s): %.2f %s
ru: Общий размер пакета (ов): %.2f %s

source: Installing %d / %d
ru: Установка %d / %d

source: Mixing file names and package names not supported yet.
ru: Сочетание имен файлов и имен пакетов пока не поддерживается.

source: Package %s is not compatible with your distribution release %s %s.
ru: Пакет %s не совместим с вашей версией дистрибутива %s %s.

source: Package %s (%s) is not compatible with your %s architecture.
ru: Пакет %s (%s) не совместим с вашей %s архитектурой.

source: External dependencies not satisfied: %s
ru: Внешние зависимости не могут быть удовлетворены: %s

source: The following packages will be installed in order to satisfy dependencies:
ru: Следующие пакеты будут установлены в соответствии с зависимостями:

source: External dependencies not satisfied
ru: Внешние зависимости не соблюдены

source: Installation order:
ru: Порядок установки:

source: %s dependency of package %s is not satisfied
ru: Зависимость %s пакета %s не соблюдена

source: Safety switch prevents the removal of following packages:
ru: Переключатель безопасности предотвратил удаление следующих пакетов:

source: Safety switch: The component system.base cannot be found.
ru: Изменение безопасности: компонент system.base не найден.

source: Package %s does not exist. Cannot remove.
ru: Пакет %s не существует. Не удален.

source: No packages to remove.
ru: Нет пакетов для удаления.

source: The following list of packages will be removed in the respective order to satisfy dependencies:
ru: Следующий список пакетов будет удален в соответствии с зависимостями:

source: Package removal declined
ru: Удаление пакета отклонено

source: Package %s is not installed. Cannot remove.
ru: Пакет %s не установлен. Удаление невозможно.

source: Conflicts remain
ru: Существуют конфликты

source: Obsoleted packages remaining
ru: Остался устаревший пакет

source: Replaced package remains
ru: Остался замененный пакет

source: You must restart the following service(s) manually for the updated software to take effect:
ru: Вы должны перезапустить следующие службы вручную для того чтобы обновления программного обеспечения вступили в силу:

source: You must restart your system for the updates in the following package(s) to take effect:
ru: Вы должны перезагрузить компьютер для того чтобы обновления следующих пакетов вступили в силу:

source: Warning: package *name* ends with '.pisi'
ru: Внимание: *имя пакета* заканчивается расширением '.pisi'

source: Package %s is not installed.
ru: Пакет %s не установлен.

source: Package %s is not available in repositories.
ru: Пакет %s не доступен в репозиториях.

source: Package %s is already at the latest release %s.
ru: Пакет %s уже последнего релиза %s.

source: The following packages have different sha1sum:
ru: Следующие пакеты имеют различные хэш-суммы:

source: The following packages will be upgraded:
ru: Следующие пакеты будут обновлены:

source: There are extra packages due to dependencies.
ru: Есть дополнительные пакеты из-за зависимостей.

source: Dependency %s of %s cannot be satisfied
ru: Зависимость %s из %s не соблюдена

source: Upgrade is not possible.
ru: Обновление не возможно.

source: Safety switch forces the installation of following packages:
ru: Изменение безопасности требует установки следующих пакетов:

source: Safety switch forces the upgrade of following packages:
ru: Изменение безопасности требует обновления следующих пакетов:

source: Cannot open package file: %s
ru: Файл пакета не может быть открыт: %s

source: Unsupported package format: %s
ru: Не поддерживаемый формат пакета: %s

source: At least one '%s' tag should have local text
ru: Хотя бы один '%s' тег должен иметь локальный текст

source: '%s' language of tag '%s' is empty
ru: Язык '%s' из тега '%s' пуст

source: LocalText: unable to get either current or default locale
ru: LocalText: не удалось получить текущую локаль, либо локаль по умолчанию

source: Tag should have at least the current locale, or failing that an English or Turkish version
ru: Тег должен быть хотя бы в текущей локали или, если это невозможно, на английском или турецком языке

source: autoxml.parse: String '%s' has errors
ru: autoxml.parse: Строка '%s' содержит ошибки

source: autoxml.read: File '%s' has errors
ru: autoxml.read: Файл '%s' содержит ошибки

source: autoxml.write: object validation has failed
ru: autoxml.write: Проверка объекта не удалась

source: autoxml.write: File encoding '%s' has errors
ru: autoxml.write: Кодировка файла '%s' содержит ошибки

source: gen_tag: unrecognized tag type %s in spec
ru: gen_tag: неизвестный тип тега %s в спектре

source: Mandatory variable %s not available
ru: Обязательная переменная %s не доступна

source: Type mismatch: read text cannot be decoded
ru: Несоответствие типов: читаемый текст не может быть распознан

source: Mandatory token %s not available
ru: Обязательный маркер %s не доступен

source: Type mismatch. Expected %s, got %s
ru: Несоответствие типов: %s вместо ожидаемого %s

source: Type mismatch: DOM cannot be decoded
ru: Несоответствие типов: DOM не может быть раскодирован

source: Mandatory argument not available
ru: Обязательный аргумент не доступен

source: Object cannot be encoded
ru: Объект не может быть закодирован

source: Object cannot be formatted
ru: Объект не может быть отформатирован

source: List type must contain only one element
ru: Списоковый тип должен содержать только один элемент

source: Mandatory list "%s" under "%s" node is empty.
ru: Обязательный список "%s" под узлом "%s" пуст.

source: getNodeText: Expected text node, got something else!
ru: getNodeText: Ожидаемый текстовый узел, получено кое-что еще!

source: String '%s' has invalid XML
ru: Строка '%s' содержит неверный XML

source: Unable to read file (%s): %s
ru: Невозможно прочитать файл (%s): %s

source: File '%s' has invalid XML
ru: Файл '%s' содержит неправильный XML

source: Repo already has package named %s.
ru: В репозитории уже есть пакет с именем %s.

source: Repo does not have package named %s.
ru: В репозитории нет пакета с именем %s.

source: Fetching source from: %s
ru: Получение исходного кода из: %s

source: Source archive is stored: %s/%s
ru: Архив исходных файлов хранится: %s/%s

source: Trying fallback address: %s
ru: Проба резервных адресов: %s

source: %s mirrors are not defined.
ru: %s зеркала не определены.

source: Fetching source from mirror: %s
ru: Загрузка архива исходного кода из зеркала: %s

source: Could not fetch source from %s mirrors.
ru: Не удалось получить исходный код из %s.

source: unpack: check_file_hash failed
ru: распаковка: не верный хэш файла

source: Unknown archive type '%s' is given for '%s'.
ru: Неизвестный тип архива '%s' задан для '%s'.

source: Pisi needs %s to unpack this archive but it is not installed.
ru: Pisi необходим %s для распаковки архива, но он не установлен.

source: URI: %s, type: %s, sha1sum: %s
ru: URI: %s, тип%s, sha1 сумма: %s

source: or
ru: или

source: Summary: %s
ru: Краткое описание: %s

source: Description: %s
ru: Описание: %s

source: Licenses: %s
ru: Лицензии: %s

source: Component: %s
ru: Компонент: %s

source: Provides:
ru: Обеспечивает:

source: Dependencies:
ru: Зависимости:

source: translations.xml file is badly formed.
ru: Некорректное форматирование файла 'translations.xml'.

source: Build Dependencies:
ru: Зависимости сборки:

source: Running
ru: Запуск

source: return value for "%s" is %s
ru: возвращение значения для "%s" есть %s

source: Including external link '%s'
ru: Включая внешнюю ссылку '%s'

source: Including directory '%s'
ru: Подключение деректории '%s'

source: You don't have necessary read permissions
ru: У вас нет необходимого разрешения на чтение

source: Cannot calculate SHA1 hash of %s
ru: Не могу вычислить SHA1 хэш для %s

source: Compression type is not valid: '%s'
ru: Тип сжатия неверный: '%s'

source: Error while decompressing %s: %s
ru: Ошибка в процессе распаковки %s: %s

source: ERROR: patch (%s) failed
ru: СБОЙ: не удалось применить патч (%s)

source: ERROR: patch (%s) failed: %s
ru: СБОЙ: не удалось применить патч (%s): %s

source: strip command failed for file '%s'!
ru: Команда strip не удалась для файла '%s'!

source: chrpath command failed for file '%s'!
ru: Команда chrpath не удалась для файла '%s'!

source: objcopy (keep-debug) command failed for file '%s'!
ru: Команда objcopy (keep-debug) не удалась для файла '%s'!

source: objcopy (add-debuglink) command failed for file '%s'!
ru: Команда objcopy (add-debuglink) не удалась для файла '%s'!

source: file command failed with return code %s for file: %s
ru: Команда завершилась неудачно с кодом ошибки %s для файла '%s'

source: Output: %s
ru: Конечная дериктория: %s

source: Invalid package name: %s
ru: Неверное имя пакета: %s

source: Invalid delta package name: %s
ru: Неверное имя дельта пакета: %s

source: Invalid version string: '%s'
ru: Недопустимая строка версии: '%s'
