Repository: PisiLinuxNew/pisi
Catalog: po/*.po
Languages: ru

source: no such option: %s
ru: опция отсутствует: %s

source: ambiguous option: %s (%s?)
ru: неоднозначная опция: %s (%s?)

source: Usage: %s
ru: Использование: %s

source: Usage
ru: Использование

source: integer
ru: целое число

source: long integer
ru: длинное целое число

source: floating-point
ru: число с плавающей точкой

source: complex
ru: комплексное число

source: option %s: invalid %s value: %r
ru: опция %s: недопустимое %s значение: %r

source: option %s: invalid choice: %r (choose from %s)
ru: опция %s: некорректный выбор: %r (выбрать из %s)

source: show this help message and exit
ru: отобразить это сообщение и завершить

source: show program's version number and exit
ru: отобразить номер версии pisi и завершить

source: %prog [options]
ru: %prog [опции]

source: %s option requires an argument
ru: опция %s требует наличия аргумента

source: %s option requires %d arguments
ru: опция %s требует %d аргументов

source: %s option does not take a value
ru: опция %s не принимает значение

source: Options
ru: Опции

source: Please attach the config.log to your bug report: %s/config.log
ru: Пожалуйста прикрепите config.log в ваш отчет об ошибке: %s/config.log

source: Configure failed.
ru: Настройка не удалась.

source: No configure script found.
ru: Файл конфигурации не найден.

source: Make failed.
ru: Ошибка сборки.

source: Install failed.
ru: Ошибка установки.

source: Running aclocal failed.
ru: Запуск aclocal не удался.

source: Running autoconf failed.
ru: Запуск autoconf не удался.

source: Running autoreconf failed.
ru: Запуск autoreconf не удался.

source: Running automake failed.
ru: Запуск automake не удался.

source: Running autoheader failed.
ru: Запуск autoheader не удался.

source: No configure script found for cmake.
ru: Не найден скрипт конфигурации для cmake.

source: No Makefile found.
ru: Makefile не найден.

source: Util %s cannot be found
ru: Утилита %s не найдена

source: Warning: %s does not exist, using plain name %s
ru: Предупреждение: %s не существует, используя %s

source: !!! Please attach the config.log to your bug report: %s/config.log
ru: !!! Пожалуйста прикрепите config.log в ваш ответ об ошибке: %s/config.log

source: Can't find kernel version information file %s.
ru: Не найден файл информации о ядре %s.

source: Running ldconfig failed.
ru: Запуск ldconfig не удался.

source: GNU Config Update Finished.
ru: GNU Config Update завершено.

source: Running libtoolize failed.
ru: Ошибка выполнения libtoolize.

source: Configuration failed.
ru: Конфигурация не удалась.

source: perl build failed.
ru: ошибка выполнения perl.

source: perl install failed.
ru: ошибка установки perl.

source: No file matched pattern "%s"
ru: Нет файла, соответствующего запросу "%s"

source: ActionsAPI [doman]: Wrong man page file: %s
ru: ActionsAPI [doman]: Неверная страница man: %s

source: No file matched pattern "%s". 'domove' operation failed.
ru: Нет файла, соответствующего шаблону "%s". 'domove' операция отменена.

source: No such file matching pattern: "%s". 'dosed' operation failed.
ru: Нет файла, соответствующего запросу: "%s". 'dosed' операция отменена.

source: dosed method has not changed file '%s'.
ru: dosed метод не поменял файл '%s'.

source: File does not exist or permission denied: %s
ru: Файл не существует или доступ запрещен: %s

source: ActionsAPI [dosym]: File already exists: %s
ru: ActionsAPI [dosym]: Файл уже существует: %s

source: No file matched pattern "%s".
ru: Нет файла, соответствующего шаблону "%s".

source: No file matched pattern "%s". Remove operation failed.
ru: Нет файла, соответствующего шаблону "%s". Операция удаления отменена.

source: No directory matched pattern "%s". Remove directory operation failed.
ru: Нет директории, соответствующего шаблону "%s". Операция удаления директории отменена.

source: Insufficient arguments.
ru: Недостаточно аргументов.

source: No executable file matched pattern "%s".
ru: Нет запускаемого файла, соответствующего шаблону "%s".

source: pkg-config is not installed on your system.
ru: Пакет pkgconfig не установлен в вашей системе.

source: Running %s failed.
ru: Запуск %s не удался.

source: Project file '%s' not found.
ru: Файл проекта '%s' не найден.

source: It seems there are more than one .pro file, you must specify one. (Possible .pro files: %s)
ru: Похоже, что .pro файлов несколько, Вы должны выбрать один. (Возможные .pro файлы: %s)

source: Running 'ruby %s' failed.
ru: Ошибка запуска 'ruby %s'.

source: Cannot create directory %s
ru: Невозможно создать директорию %s

source: ActionsAPI [echo]: Can't append to file %s.
ru: ActionsAPI [echo]: Невозможно добавить в файл %s.

source: ActionsAPI [chmod]: No file matched pattern "%s".
ru: ActionsAPI [chmod]: Нет файла, соответствующего шаблону "%s".

source: ActionsAPI [chmod]: Operation not permitted: %s (mode: 0%o)
ru: ActionsAPI [chmod]: Операция не разрешается: %s (режим: 0%o)

source: ActionsAPI [chmod]: File %s doesn't exists.
ru: ActionsAPI [chmod]: Файл %s не существует.

source: ActionsAPI [chown]: Operation not permitted: %s (uid: %s, gid: %s)
ru: ActionsAPI [chown]: Операция не разрешает: %s (uid: %s, gid: %s)

source: ActionsAPI [chown]: File %s doesn't exists.
ru: ActionsAPI [chown]: Файл %s не существует.

source: ActionsAPI [sym]: Permission denied: %s to %s
ru: ActionsAPI [sym]: Доступ запрещен: %s to %s

source: ActionsAPI [unlink]: Permission denied: %s.
ru: ActionsAPI [unlink]: Доступ запрещен: %s.

source: ActionsAPI [unlink]: File %s doesn't exists.
ru: ActionsAPI [unlink]: Файл %s не существует.

source: ActionsAPI [unlinkDir]: Operation not permitted: %s
ru: ActionsAPI [unlinkDir]: Операция не разрешается: %s

source: ActionsAPI [unlinkDir]: Directory %s doesn't exists.
ru: ActionsAPI [unlinkDir]: Директория %s не существует.

source: ActionsAPI [move]: No file matched pattern "%s".
ru: ActionsAPI [move]: Нет файла, соответствующего шаблону "%s".

source: ActionsAPI [move]: Permission denied: %s to %s
ru: ActionsAPI [move]: Доступ запрещен: %s to %s

source: ActionsAPI [move]: File %s doesn't exists.
ru: ActionsAPI [move]: Файл %s не существует.

source: ActionsAPI [copy]: No file matched pattern "%s".
ru: ActionsAPI [copy]: Нет файла, соответствующего шаблону "%s".

source: ActionsAPI [copy]: Permission denied: %s to %s
ru: ActionsAPI [copy]: Доступ запрещен: %s to %s

source: ActionsAPI [copy]: File %s does not exist.
ru: ActionsAPI [copy]: Файл %s не существует.

source: ActionsAPI [copytree]: Directory %s doesn't exists.
ru: ActionsAPI [copytree]: Директория %s не существует.

source: ActionsAPI [touch]: No file matched pattern "%s".
ru: ActionsAPI [touch]: Нет файла, соответствующего шаблону "%s".

source: ActionsAPI [touch]: Permission denied: %s
ru: ActionsAPI [touch]: Доступ запрещен: %s

source: Command "%s" failed, return value was %d.
ru: Команда "%s" завершилась с ошибкой, возвращенное значение было %d.

source: Moving source files failed
ru: Перемещение файлов исходного кода завершилось с ошибкой

source: Generate config files failed
ru: Создание конфигурационных файлов завершилось с ошибкой

source: Building format files failed
ru: Ошибка выполнения файла

source: Creating symlinks from format to engines failed
ru: Создание ссылок данного формата на устройства не удалось

source: Installing docs failed
ru: Установка документации не удалась

source: Installing texmf files failed
ru: Установка файлов texmf не удалась

source: Installing config files failed
ru: Установка конфигурационных файлов не удалась

source: Handle config files failed
ru: Установка конфигурационных файлов устройств не удалось

source: Symlink %s skipped (special case)
ru: Символическая ссылка %s пропущена (особый случай)

source: Symlink %s -> %s skipped (texlive-core takes care of it.
ru: Символическая ссылка %s -> %s пропущена (texlive-core заботится об этом.

source: Symlink %s -> %s skipped.
ru: Символическая ссылка %s -> %s пропущена.

source: Symlink %s skipped (file exists.)
ru: Символическая ссылка %s пропущена (файл существует.)

source: Making symlink from %s to %s
ru: Создание символической ссылки %s to %s

source: Creating /etc/texmf/%s.d
ru: Создание /etc/texmf/%s.d

source: Moving (and symlinking) /usr/share/texmf/%s to /etc/texmf/%s.d
ru: Перемещение (и создание символических ссылок) /usr/share/texmf/%s to /etc/texmf/%s.d

source: Building format file %s
ru: Формат исполняемого файла %s

source: MixedMap %s is added to %s/%s.cfg
ru: MixedMap %s добавлен в %s/%s.cfg

source: p +%s is added to %s/%s-config.ps
ru: p +%s добавлено в %s/%s-config.ps

source: f %s is added to %s/%s-config
ru: f %s добавлено в %s/%s-config

source: Language file %s already generated.
ru: Языковой файл %s уже сформирован.

source: No rule to proccess %s. Please file a bug.
ru: Нет правила для обработки %s. Пожалуйста, сообщите об ошибке.

source: You have to be root for this operation.
ru: Вы должны иметь привилегии суперпользователя для этой операции.

source: Another instance of PiSi is running. Only one instance is allowed.
ru: Работает другой экземпляр PiSi. Допускается работа только одного экземпляра программы.

source: %s package found in %s repository
ru: %s пакет найден в %s репозитории

source: %s package already fetched
ru: %s пакет уже получен

source: Cleaning package cache %s...
ru: Очистка кэша пакетов %s...

source: Cleaning source archive cache %s...
ru: Очистка кеша архивов исходных файлов %s...

source: Cleaning temporary directory %s...
ru: Очистка временного каталога %s...

source: Removing cache file %s...
ru: Удаление файла кэша %s...

source: Taking snapshot of the system
ru: Снятие снимка с системы

source: comar package is not fully installed
ru: Пакет сomar не полностью установлен

source: File %s not found
ru: Файл %s не найден

source: Building index of PiSi files under %s
ru: Создание индексов файлов PiSi для %s

source: Index file written
ru: Файл индекса записан

source: Not a valid repo name.
ru: Неверное имя репозитория.

source: Repo %s already present.
ru: Репозиторий %s уже существует.

source: Repo already present with name %s.
ru: Репозиторий уже существует с именем %s.

source: Repo %s added to system.
ru: Репозиторий %s добавлен в систему.

source: Repo %s removed from system.
ru: Репозиторий %s удален из системы.

source: Repository %s does not exist. Cannot remove.
ru: Репозиторий %s не существует и не может быть удален.

source: Updating repository: %s
ru: Обновление репозитория: %s

source: %s repository information is up-to-date.
ru: %s информация о репозитории обновлена.

source: Updating database at any rate as requested
ru: Обновление базы данных в любом случае как запрос

source: Package database updated.
ru: База данных пакетов обновлена.

source: No repository named %s found.
ru: Не найден репозиторий с именем %s .

source: Problem occured while uncompressing %s.Z file
ru: Обнаружена ошибка во время распаковки %s.Z файла

source: Package %s found in repository %s
ru: Пакет %s найден в репозитории %s

source: Package URI: %s
ru: URI пакета: %s

source: Download Error: Package does not match the repository package.
ru: Ошибка загрузки: Пакет не соответствует пакету из репозитория.

source: Package %s not found in any active repository.
ru: Пакет %s не найден в активном репозитории.

source: Installing %s, version %s, release %s
ru: Установка %s, версия %s, релиз %s

source: %s-%s is not a valid PiSi version format
ru: %s-%s не правильная версия PiSi

source: %s package cannot be installed unless the dependencies are satisfied
ru: Пакет %s не может быть установлен, пока все зависимости не будут удовлетворены

source: /%s from %s package
ru: /%s для %s пакет

source: File conflicts: %s
ru: Конфликтные файлы: %s

source: Re-install same version package?
ru: Переустановить версию пакета?

source: Package re-install declined
ru: Переустановка пакета отменена

source: Storing old paths info
ru: Сохраненте информации о старых путях

source: Upgrading to new upstream version
ru: Обновление до новой версии

source: Upgrading to new distribution release
ru: Обновление до нового релиза пакета

source: Downgrade to old distribution release?
ru: Обновить до более старой версии дистрибутива?

source: Package downgrade declined
ru: Обновление до более старой версии отменено

source: %s configuration failed.
ru: %s ошибка конфигурации.

source: Unable to relocate following files. Reinstallation of this package is strongly recommended.
ru: Невозможно разрешить попытку перемещения данных файлов. Настоятельно рекомендуется повторная установка .

source: Storing %s
ru: Хранение %s

source: File list could not be read for package %s, continuing removal.
ru: Список файлов не может быть прочитан для пакета %s, продолжение удаления.

source: Removing package %s
ru: Удаление пакета %s

source: Trying to remove nonexistent package
ru: Попытка удаления несуществующего пакета

source: Not removing conflicted file : %s
ru: Не удаляется конфликтующий файл: %s

source: Installed file %s does not exist on system [Probably you manually deleted]
ru: Установленный файл %s не существует в системе. [Возможно, он был удален вручную]

source: Warning:
ru: Предупреждение:

source: Error:
ru: Ошибка:

source: (yes/no)
ru: (да/нет)

source: [complete]
ru: [завершено]

source: Installed %s
ru: %s установлен

source: Removed %s
ru: %s удален

source: Upgraded %s
ru: %s обновлен

source: Configured %s
ru: %s настроен

source: Extracting the files of %s
ru: Распаковка файлов пакета %s

source: Add a repository Usage: add-repo <repo> <indexuri> <repo>: name of repository to add <indexuri>: URI of index file NB: We support only local files (e.g., /a/b/c) and http:// URIs at the moment
ru: Добавление репозитория Использование: add-repo <repo> <indexuri> <repo>: имя добавляемого репозитория <indexuri>: URL-ссылка на индексный файл Если репозиторий для добавления не задан, будет добавлен репозиторий pardus-devel NB: На данный момент, реализована поддержка только локальных файлов (e.g., /a/b/c) и http:// URI-ссылок

source: add-repo options
ru: опции add-repo

source: Ignore repository distribution check
ru: Игнорировать проверку репозитория

source: Does not fetch repository index and does not check distribution match
ru: Не получает индекса в репозитории и не проверять соответствие цели

source: Add repository at given position (0 is first)
ru: Добавить репозиторий в данной позиции (0 - первый)

source: Add %s repository without updating the database? By confirming this you are also adding the repository to your system without checking the distribution of the repository. Do you want to continue?
ru: Добавить репозиторий %s без обновления базы данных? Соглашаясь с этим, вы добавите репозиторий без проверки целостности дистрибутива. Вы хотите продолжить?

source: %s repository could not be reached. Removing %s from system.
ru: %s репозиторий не найден. Удаление %s из системы.

source: Information about the package owner and release Usage: blame <package> ... <package>
ru: Информация об авторе пакта, его версии и релизе Использование: blame <package> ... <package>

source: blame options
ru: blame опции

source: Blame for the given release
ru: Blame для текущего релиза

source: Blame for all of the releases
ru: Blame для всех релизов

source: Name: %s, version: %s, release: %s
ru: Имя: %s, версия: %s, релиз: %s

source: Package Maintainer: %s <%s>
ru: Майнтейнер пакета: %s <%s>

source: Release Updater: %s <%s>
ru: Автор обновления: %s <%s>

source: Update Date: %s
ru: Дата обновления: %s

source: Build PiSi packages Usage: build [<pspec.xml> | <sourcename>] ... You can give a URI of the pspec.xml file. PiSi will fetch all necessary files and build the package for you. Alternatively, you can give the name of a source package to be downloaded from a repository containing sources.
ru: Создание пакетов PiSi Использование: build [<pspec.xml> | <sourcename>] ... Вы можете предложить URI pspec.xml файла. PiSi проверит все необходимые файлы и создаст пакет для вас. Как другой вариант, вы можете предложить имя пакета с исходными файлами, который будет скачан с репозитория, содержащего исходные файлы

source: build options
ru: build опции

source: Run pisi build operation without printing extra debug information
ru: Запустить pisi build без вывода дополнительной отладочной информации

source: Do not take dependency information into account
ru: Не вкладывать информацию о зависимостях в аккаунт

source: Output directory for produced packages
ru: Директория для вновь созданных пакетов

source: Bypass errors from ActionsAPI
ru: Bypass ошибка ActionsAPI

source: Bypass safety switch
ru: Пропустить проверку безопасности

source: Bypass testing step
ru: Пропустить тестирование

source: Create a static package with ar files
ru: Создание пакета PiSi

source: Create the binary package using the given format. Use '-F help' to see a list of supported formats.
ru: Создать бинарный пакет, используя указанный формат. Команда 'pisi bi -F help' выводит список доступных форматов.

source: Use quilt patch management system instead of GNU patch
ru: %s (по-умолчанию)

source: Do not constrain build process inside the build folder
ru: Целевая директория: %s

source: build steps
ru: последовательность сборки

source: Break build after fetching the source archive
ru: Прервать сборку после получения архива с исходными кодами

source: Break build after unpacking the source archive, checking sha1sum and applying patches
ru: Прервать сборку после распаковки архива с исходным кодом, проверки кортрольной суммы и применения патчей

source: Break build after running configure step
ru: Прервать сборку после запуска этапа настройки

source: Break build after running compile step
ru: Прервать сборку после запуска этапа компиляции

source: Break build after running check step
ru: Прервать сборку после запуска этапа проверки

source: Break build after running install step
ru: Прервать сборку после запуска этапа установки

source: Create PiSi package
ru: Создать PiSi пакет

source: Supported package formats:
ru: Поддерживаемые форматы пакетов:

source: Verify installation Usage: check [<package1> <package2> ... <packagen>] check -c <component> <packagei>: package name A cryptographic checksum is stored for each installed file. Check command uses the checksums to verify a package. Just give the names of packages. If no packages are given, checks all installed packages.
ru: Проверка установки Использование: check [<пакет1> <пакет2> ... <пакетn>] <пакетi>: имя пакета Зашифрованная контрольная сумма хранится в каждом установленном файле . Эта команда использует контрольные суммы для проверки пакета. Просто задайте имена пакетов. Если не будет задано имен пакетов, будут проверены все установленные пакеты.

source: check options
ru: Проверка опций

source: Check installed packages under given component
ru: Проверка установленных пакетов по данному компоненту

source: Checks only changed config files of the packages
ru: Проверка измения конфигурационных файлов пакетов

source: Checking all installed packages
ru: Проверка всех установленных пакетов

source: Checking integrity of %s
ru: Проверка целостности %s

source: Broken
ru: Сломано

source: Unknown
ru: Неизвестно

source: OK
ru: ОК

source: Missing file: /%s
ru: Отсутствующий файл: /%s

source: Access denied: /%s
ru: Доступ запрещен: /%s

source: Corrupted file: /%s
ru: Поврежденный файл: /%s

source: Modified configuration file: /%s
ru: Измененный файл конфигурации: /%s

source: Package %s not installed
ru: Пакет %s не установлен

source: Pisi was unable to check the integrity of packages which contain files that you don't have read access. Running the check under a privileged user may help fixing this problem.
ru: Pisi не смог проверить целостность пакетов, которые содержат файлы, к которым у вас нет доступа на чтение. Запуск с правами привелерованного пользователя может помочь решить эту проблему.

source: Clean stale locks Usage: clean PiSi uses filesystem locks for managing database access. This command deletes unused locks from the database directory.
ru: Очистить файлы блокировки Использование: clean PiSi использует файлы блокировки состояния для управления доступом в базу данных. Эта команда удалит неиспользуемые файлы блокировки из директории базы данных.

source: Command lacks name
ru: У команды отсутствует имя

source: Duplicate command %s
ru: Дублирование команды %s

source: Unrecognized command: %s
ru: Неизвестная комманда: %s

source: general options
ru: общие параметры

source: Change the system root for PiSi commands
ru: Изменение корневой системы для команд PiSi

source: Assume yes in all yes/no queries
ru: Отвечать ДА на все запросы ДА/НЕТ

source: Keep bandwidth usage under specified KB's
ru: Ограничить пропускную способность в КБ

source: Detailed output
ru: Подробный вывод

source: Show debugging information
ru: Показать информацию об отладке

source: Suppresses all coloring of PiSi's output
ru: Убирает цветной вывод PiSi

source: Destination directory %s does not exist. Creating directory.
ru: Целевая директория %s не найдена. Создание директории.

source: Password:
ru: Пароль:

source: Command terminated abnormally.
ru: Аварийное завершение команды.

source: Bypass comar configuration agent
ru: Пропустить утилиту конфигурирования comar

source: Do not perform any action, just show what would be done
ru: Не выполнять никаких действий, просто смотреть, что могло бы произойти

source: usage: %s
ru: использование: %s

source: Configure pending packages If COMAR configuration of some packages were not done at installation time, they are added to a list of packages waiting to be configured. This command configures those packages.
ru: Конфигурировать задерженные пакеты lf COMAR конфигурация не будет сделана во время установки, они будут добавлены в список пакетов, ожидающих конфигурирования. Эта команда сконфигурирует такие пакеты.

source: configure-pending options
ru: Опции задержки конфигурирования

source: Delete cache files Usage: delete-cache Sources, packages and temporary files are stored under /var directory. Since these accumulate they can consume a lot of disk space.
ru: Удалить файлы кэша Использование: delete-cache Пакеты с исходниками, бинарные пакеты и временные файоы хранятся в директории /var. После удаления этих файлов может освободиться много дискового пространства.

source: Creates delta packages Usages: delta oldpackage1 oldpackage2 ... newpackage delta -t newpackage oldpackage1 oldpackage2 ... Delta command finds the changed files between the given packages by comparing the sha1sum of files and creates a delta package with the changed files.
ru: Создание дельта-пакетов Искользование: delta oldpackage1 oldpackage2 ... newpackage delta -t newpackage oldpackage1 oldpackage2 ... Команда Delta ищет измененные файлы в данных пакетах, сравнивая sha1-суммы файлов и создает дельта-пакет с измененными файлами.

source: delta options
ru: delta опции

source: Use arg as the new package and treat other arguments as old packages.
ru: Использовать аргумент как новый пакет и трактовать другие аргументы как старые пакеты.

source: Output directory for produced packages.
ru: Выводная директория для создаваемых пакетов.

source: Disable repository Usage: disable-repo [<repo1> <repo2> ... <repon>] <repoi>: repository name Disabled repositories are not taken into account in operations
ru: Отключить репозиторий Использование: disable-repo [<repo1> <repo2> ... <repon>] <repoi>: имя репозитория Отключенные репозитории не используются при операциях над пакетами
